
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Поставщик", Поставщик);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Поставщик КАК Поставщик,
	               |	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВРубляхОстаток, 0) КАК СуммаВРубляхОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВUSDОстаток, 0) КАК СуммаВUSDОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВEURОстаток, 0) КАК СуммаВEURОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Поставщик = &Поставщик) КАК ВзаиморасчетыОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыОстатки.Соглашение.ДатаОплаты";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Если ЗначениеЗаполнено(Соглашение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Поставщик", "&Поставщик И Соглашение = &Соглашение");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаКОплате = СуммаВРублях;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() И СуммаКОплате > 0 Цикл
		
		СуммаКЗачету = Мин(СуммаКОплате, Выборка.СуммаВРубляхОстаток);
		
		Если СуммаКЗачету = Выборка.СуммаВРубляхОстаток Тогда
			СуммаКЗачетуВUSD = Выборка.СуммаВUSDОстаток;
			СуммаКЗачетуВEUR = Выборка.СуммаВEURОстаток;
		Иначе
			СуммаКЗачетуВUSD = СуммаКЗачету/Курс_USD;
			СуммаКЗачетуВEUR = СуммаКЗачету/Курс_EUR;
		КонецЕсли;
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Соглашение = Соглашение;
		Движение.СуммаВРублях = СуммаКЗачету;
		Движение.СуммаВUSD = СуммаКЗачетуВUSD;
		Движение.СуммаВEUR = СуммаКЗачетуВEUR;
		
		СуммаКОплате = СуммаКОплате + СуммаКЗачету;
		
	КонецЦикла;
	
	Если СуммаКОплате > 0 Тогда
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Соглашение = Справочники.Соглашения.ПустаяСсылка();
		Движение.СуммаВРублях = СуммаКОплате;
		Движение.СуммаВUSD = СуммаКОплате/Курс_USD;
		Движение.СуммаВEUR = СуммаКОплате/Курс_EUR;
		
	КонецЕсли;
	
КонецПроцедуры
