
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВРубляхОстаток, 0) КАК СуммаВРубляхОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВUSDОстаток, 0) КАК СуммаВUSDОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВEURОстаток, 0) КАК СуммаВEURОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Поставщик = &Поставщик) КАК ВзаиморасчетыОстатки
	               |ГДЕ
	               |	ВзаиморасчетыОстатки.СуммаВРубляхОстаток <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыОстатки.Соглашение.ДатаОплаты";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.СуммаВРублях = СуммаВРублях;
		Движение.СуммаВUSD = СуммаВРублях/Курс_USD;
		Движение.СуммаВEUR = СуммаВРублях/Курс_EUR;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		
		
	КонецЕсли;
	
	
		
		
	//	СуммаКСписанию = СуммаВРублях;
	//	
	//	Если СуммаКСписанию > Выборка.СуммаВРубляхОстаток Тогда
	//	// регистр Взаиморасчеты Расход
	//	

	//	
	//	КонецЦикла;
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	////
	//Если ЗначениеЗаполнено(Соглашение) Тогда
	//	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	//								"Поставщик = &Поставщик",
	//								"Поставщик = &Поставщик И Соглашение = &Соглашение");
	//	
	//	Результат = Запрос.Выполнить().Выбрать();
	//	
	//	Если Результат.Следующий() Тогда
	//		
	//		бы
	//		
	//	КонецЕсли;
	//	
	//	//Проверить сумму поставок
	//Иначе
	//	
	//КонецЕсли;
	//
	//Результат = Запрос.Выполнить().Выбрать();
	//
	//
	//
	
	

КонецПроцедуры
