
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Поставщик", Поставщик);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Поставщик КАК Поставщик,
	               |	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток < 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток * -1
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток ЕСТЬ NULL
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток = 0
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток > 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВРубляхОстаток
	               |	КОНЕЦ КАК СуммаВРубляхОстаток,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток < 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток * -1
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток ЕСТЬ NULL
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток = 0
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток > 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВUSDОстаток
	               |	КОНЕЦ КАК СуммаВUSDОстаток,
	               |	ВЫБОР
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток < 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток * -1
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток ЕСТЬ NULL
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток = 0
	               |		КОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток > 0
	               |			ТОГДА ВзаиморасчетыОстатки.СуммаВEURОстаток
	               |	КОНЕЦ КАК СуммаВEURОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Поставщик = &Поставщик) КАК ВзаиморасчетыОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыОстатки.Соглашение.ДатаОплаты";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Если ЗначениеЗаполнено(Соглашение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Поставщик", "&Поставщик И Соглашение = &Соглашение");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаКОплате = СуммаВРублях;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() И СуммаКОплате > 0 Цикл
		
		СуммаВРубляхОстаток = ?(Выборка.СуммаВРубляхОстаток < 0,
								Выборка.СуммаВРубляхОстаток * (-1),
								Выборка.СуммаВРубляхОстаток);
		
		СуммаКЗачету = Мин(СуммаКОплате, СуммаВРубляхОстаток);

		Если СуммаКЗачету = СуммаВРубляхОстаток Тогда
			СуммаКЗачетуВUSD = Выборка.СуммаВUSDОстаток;
			СуммаКЗачетуВEUR = Выборка.СуммаВEURОстаток;
		Иначе
			СуммаКЗачетуВUSD = СуммаКЗачету/Курс_USD;
			СуммаКЗачетуВEUR = СуммаКЗачету/Курс_EUR;
		КонецЕсли;
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Соглашение = Выборка.Соглашение;
		Движение.СуммаВРублях = СуммаКЗачету;
		Движение.СуммаВUSD = СуммаКЗачетуВUSD;
		Движение.СуммаВEUR = СуммаКЗачетуВEUR;
		
		СуммаКОплате = СуммаКОплате - СуммаКЗачету;
		
	КонецЦикла;
	
	Если СуммаКОплате > 0 Тогда
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Соглашение = Справочники.Соглашения.ПустаяСсылка();
		Движение.СуммаВРублях = СуммаКОплате;
		Движение.СуммаВUSD = СуммаКОплате/Курс_USD;
		Движение.СуммаВEUR = СуммаКОплате/Курс_EUR;
		
	КонецЕсли;
	
КонецПроцедуры
