
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОтчетыКомитенту Приход
	Движения.ОтчетыКомитенту.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенегСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор КАК Договор,
		|	СУММА(РасходДенегСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходДенегСписокНоменклатуры.Сумма) КАК Сумма
		|ИЗ
		|	Документ.РасходДенег.СписокНоменклатуры КАК РасходДенегСписокНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенегСписокНоменклатуры.Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОтчетыКомитенту.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	Движения.ОтчетыКомитенту.БлокироватьДляИзменения = Истина;
	Движения.Записать();

КонецПроцедуры
