
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		
		МассивСлов = СтрРазделить(Объект.Комментарий, " ");
		 
		Для Каждого Слово Из МассивСлов Цикл
			Попытка
				Если СтрНачинаетсяС(Слово, "e1cib/") Тогда
					ПерейтиПоНавигационнойСсылке(Слово);
					Возврат;
				КонецЕсли;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				Сообщение.Поле = "Комментарий";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
