
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор КАК Договор,
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма,
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор.ПроцентКомитента КАК ДоговорПроцентКомитента
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор,
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор.ПроцентКомитента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Менеджер = Менеджер;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.СуммаКомитента = ВыборкаДетальныеЗаписи.Сумма * ВыборкаДетальныеЗаписи.ДоговорПроцентКомитента /100;
	КонецЦикла;
	
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записать();
	
	// регистр ОтчетыКомитенту Приход
	Движения.ОтчетыКомитенту.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор КАК Договор,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТабличнаяЧасть.Номенклатура КАК Номенклатура,
		|	ВТ_ТабличнаяЧасть.Договор КАК Договор,
		|	ВТ_ТабличнаяЧасть.Количество КАК Количество,
		|	ВТ_ТабличнаяЧасть.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВТ_ТабличнаяЧасть.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ВТ_ТабличнаяЧасть.Договор.Представление КАК ДоговорПредставление
		|ИЗ
		|	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				(Номенклатура, Договор) В
		|					(ВЫБРАТЬ
		|						ВТ_ТабличнаяЧасть.Номенклатура КАК Номенклатура,
		|						ВТ_ТабличнаяЧасть.Договор КАК Договор
		|					ИЗ
		|						ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть)) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_ТабличнаяЧасть.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|			И ВТ_ТабличнаяЧасть.Договор = ОстаткиНоменклатурыОстатки.Договор";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
	Блокировка.Заблокировать();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаСообщения = "";
		
		Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
		КонтрольнаяСумма = ?(Выборка.КоличествоОстаток > 0, Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Выборка.Количество, 0);
		
		Если Нехватка > 0 Тогда
			СтрокаСообщения = СтрокаСообщения + СтрШаблон("%1: по позиции: ""%2"" не хватает на складе %3 шт.",
															Выборка.ДоговорПредставление,
															Выборка.НоменклатураПредставление,
															Нехватка);
			Отказ = Истина;
		КонецЕсли;
		
		Если КонтрольнаяСумма > Выборка.Сумма Тогда
			
			Если ЗначениеЗаполнено(СтрокаСообщения) Тогда
				СтрокаСообщения = СтрокаСообщения + Символы.ПС;
			КонецЕсли;
			
			СтрокаСообщения = СтрокаСообщения + СтрШаблон("%1: по товарной позиции: ""%2"" занижена сумма реализации. 
															|Сумма продажи должна быть не меньше %3",
															Выборка.ДоговорПредставление,
															Выборка.НоменклатураПредставление,
															КонтрольнаяСумма);
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСообщения) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрокаСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
	
		СуммаКСписанию = ?(Выборка.Количество = Выборка.КоличествоОстаток,
						Выборка.СуммаОстаток,
						Выборка.СуммаОстаток / Выборка.КоличествоОстаток * Выборка.Количество);
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Договор = Выборка.Договор;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = СуммаКСписанию;
		
		Движение = Движения.ОтчетыКомитенту.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Договор = Выборка.Договор;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
