
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
	Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
	Движение.Период = Дата;
	Движение.Сумма = СуммаПоДокументу;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Товары);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
					|	РасходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество
					|ПОМЕСТИТЬ ВТ_ТабЧасть
					|ИЗ
					|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
					|ГДЕ
					|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
					|
					|СГРУППИРОВАТЬ ПО
					|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
					|	РасходнаяНакладнаяСписокНоменклатуры.Количество
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ТабЧасть.Номенклатура КАК Номенклатура,
					|	ВТ_ТабЧасть.Номенклатура.Представление КАК НоменклатураПредставление,
					|	ВТ_ТабЧасть.Количество КАК Количество,
					|	УправленческийОстаткиСрок.Субконто2 КАК СрокГодности,
					|	ЕСТЬNULL(УправленческийОстаткиСрок.КоличествоОстаток, 0) КАК КоличествоОстаток,
					|	ЕСТЬNULL(УправленческийОстаткиТовар.КоличествоОстаток, 0) КАК КоличествоОстатокТовар,
					|	ЕСТЬNULL(УправленческийОстаткиТовар.СуммаОстаток, 0) КАК СуммаОстатокТовар
					|ИЗ
					|	ВТ_ТабЧасть КАК ВТ_ТабЧасть
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
					|				&МоментВремени,
					|				Счет = &Счет,
					|				&СубконтоСрок,
					|				Субконто1 В
					|					(ВЫБРАТЬ
					|						ВТ_ТабЧасть.Номенклатура КАК Номенклатура
					|					ИЗ
					|						ВТ_ТабЧасть КАК ВТ_ТабЧасть)) КАК УправленческийОстаткиСрок
					|		ПО (ВТ_ТабЧасть.Номенклатура = УправленческийОстаткиСрок.Субконто1)
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
					|				&МоментВремени,
					|				Счет = &Счет,
					|				&СубконтоТовар,
					|				Субконто1 В
					|					(ВЫБРАТЬ
					|						ВТ_ТабЧасть.Номенклатура КАК Номенклатура
					|					ИЗ
					|						ВТ_ТабЧасть КАК ВТ_ТабЧасть)) КАК УправленческийОстаткиТовар
					|		ПО (ВТ_ТабЧасть.Номенклатура = УправленческийОстаткиТовар.Субконто1)
					|УПОРЯДОЧИТЬ ПО
					|	СрокГодности ВОЗР
					|ИТОГИ
					|	МАКСИМУМ(Количество),
					|	СУММА(КоличествоОстаток),
					|	МАКСИМУМ(КоличествоОстатокТовар),
					|	МАКСИМУМ(СуммаОстатокТовар)
					|ПО
					|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.Товары);
	
	СубконтоСрок = Новый Массив;
	СубконтоСрок.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СубконтоСрок.Добавить(ПланыВидовХарактеристик.ВидыСубконто.СрокГодности);
	Запрос.УстановитьПараметр("СубконтоСрок", СубконтоСрок);
	
	СубконтоТовар = Новый Массив;
	СубконтоТовар.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("СубконтоТовар", СубконтоТовар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("БУХ: Номенклатуры %1 недостаточно! В наличии %2, необходимо %3",
											ВыборкаНоменклатура.НоменклатураПредставление,
											ВыборкаНоменклатура.КоличествоОстатокТовар,
											ВыборкаНоменклатура.Количество);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			СебестоимостьЕдиницы = ВыборкаНоменклатура.СуммаОстатокТовар / ВыборкаНоменклатура.КоличествоОстатокТовар;
			
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			
			КоличествоОсталосьСписать = ВыборкаНоменклатура.Количество;
			КоличествоСписано = 0;
			СуммаОсталосьСписать = ВыборкаНоменклатура.СуммаОстатокТовар;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() И КоличествоОсталосьСписать > 0 Цикл
				
				КоличествоСписать = Мин(КоличествоОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
				Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
				Движение.Период = Дата;
				Движение.КоличествоКт = КоличествоСписать;
				
				КоличествоСписано = КоличествоСписано + Движение.КоличествоКт;
				
				Если ВыборкаДетальныеЗаписи.КоличествоОстатокТовар = КоличествоСписано Тогда
					Движение.Сумма = СуммаОсталосьСписать;
				Иначе
					Движение.Сумма = Движение.КоличествоКт * СебестоимостьЕдиницы;
				КонецЕсли;
				
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СрокГодности] = ВыборкаДетальныеЗаписи.СрокГодности;
				
				КоличествоОсталосьСписать = КоличествоОсталосьСписать - Движение.КоличествоКт;
				СуммаОсталосьСписать = СуммаОсталосьСписать - Движение.Сумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
