
&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма,
		|	ВзаиморасчетыССотрудникамиОстатки.ВидРасчета КАК ВидРасчета,
		|	ОсновнаяВалютаРасчетаСрезПоследних.Валюта КАК ВалютаУчета
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(&Период, Подразделение = &Подразделение) КАК ВзаиморасчетыССотрудникамиОстатки,
		|	РегистрСведений.ОсновнаяВалютаРасчета.СрезПоследних(&Период, ) КАК ОсновнаяВалютаРасчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Сообщить("Для заполнения необходимо заполнить поле ""Подразделение""");
	ИначеЕсли Объект.Проведен Тогда	
		Сообщить("Для заполнения необходимо отменить проведение документа");
	Иначе
		Объект.Сотрудники.Очистить();
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры
