
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаВРублях = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВРубляхОстаток, 0) КАК СуммаВРубляхОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВUSDОстаток, 0) КАК СуммаВUSDОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВEURОстаток, 0) КАК СуммаВEURОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(
	               |			&МоментВремени,
	               |			Поставщик = &Поставщик
	               |				И Соглашение ЕСТЬ NULL) КАК ВзаиморасчетыОстатки
	               |ГДЕ
	               |	ВзаиморасчетыОстатки.СуммаВРубляхОстаток > 0";

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	РазмерАванса = 0;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать().Следующий();
		РазмерАванса = Выборка.СуммаВРубляхОстаток;
	КонецЕсли;
	
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Поставщик = Поставщик;
	Движение.Соглашение = Соглашение;
	Движение.СуммаВРублях = СуммаВРублях - РазмерАванса;
	Движение.СуммаВUSD = Движение.СуммаВРублях / Курс_USD;
	Движение.СуммаВEUR = Движение.СуммаВРублях / Курс_EUR;
	
КонецПроцедуры
