
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаВРублях = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = НовыйЗапрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Поставщик КАК Поставщик,
	|	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВРубляхОстаток) КАК СуммаВРубляхОстаток,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВUSDОстаток) КАК СуммаВUSDОстаток,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВEURОстаток) КАК СуммаВEURОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки
	|ГДЕ
	|	ВзаиморасчетыОстатки.Поставщик = &Поставщик
	|	И ВзаиморасчетыОстатки.Соглашение = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыОстатки.Поставщик,
	|	ВзаиморасчетыОстатки.Соглашение";
	
	
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Поставщик = Поставщик;
	Движение.Соглашение = Соглашение;
	Движение.СуммаВРублях = СуммаВРублях;
	Движение.СуммаВUSD = Движение.СуммаВРублях / Курс_USD;
	Движение.СуммаВEUR = Движение.СуммаВРублях / Курс_EUR;
	
КонецПроцедуры
