
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаВРублях = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СостояниеВзаиморасчетов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Поставщик", Поставщик);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Поставщик КАК Поставщик,
	|	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВРубляхОстаток) КАК СуммаВРубляхОстаток,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВUSDОстаток) КАК СуммаВUSDОстаток,
	|	СУММА(ВзаиморасчетыОстатки.СуммаВEURОстаток) КАК СуммаВEURОстаток
	|ИЗ
	|	РегистрНакопления.СостояниеВзаиморасчетов.Остатки КАК ВзаиморасчетыОстатки
	|ГДЕ
	|	ВзаиморасчетыОстатки.Поставщик = &Поставщик
	|	И ВзаиморасчетыОстатки.Соглашение = ЗНАЧЕНИЕ(Справочник.Соглашения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыОстатки.Поставщик,
	|	ВзаиморасчетыОстатки.Соглашение";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	СуммаПрихода = СуммаВРублях;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() И СуммаПрихода > 0 Цикл
			
			СуммаСписания = Мин(СуммаПрихода, Выборка.СуммаВРубляхОстаток);
			
			Если СуммаСписания = Выборка.СуммаВРубляхОстаток Тогда
				СуммаКЗачетуВUSD = Выборка.СуммаВUSDОстаток;
				СуммаКЗачетуВEUR = Выборка.СуммаВEURОстаток;
			Иначе
				СуммаКЗачетуВUSD = СуммаСписания / Курс_USD;
				СуммаКЗачетуВEUR = СуммаСписания / Курс_EUR;
			КонецЕсли;
			
			Движение = Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Поставщик = Поставщик;
			Движение.Соглашение = Выборка.Соглашение;
			Движение.СуммаВРублях = СуммаСписания;
			Движение.СуммаВUSD = СуммаКЗачетуВUSD;
			Движение.СуммаВEUR = СуммаКЗачетуВEUR;
			
			СуммаПрихода = СуммаПрихода - СуммаСписания;
			
		КонецЦикла;
	КонецЕсли;
	
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Поставщик = Поставщик;
	Движение.Соглашение = Соглашение;
	Движение.СуммаВРублях = СуммаПрихода;
	Движение.СуммаВUSD = СуммаПрихода / Курс_USD;
	Движение.СуммаВEUR = СуммаПрихода / Курс_EUR;
	
КонецПроцедуры
