
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма,
		|	ВзаиморасчетыССотрудникамиОстатки.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(&Период, Подразделение = &Подразделение) КАК ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаСотрудники);
	КонецЦикла;

КонецПроцедуры
