Функция МетодСписанияНаДатуДокумента(Дата) Экспорт
	
	РезультатФункции = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МетодСписанияТМЦСрезПоследних.МетодСписанияТМЦ КАК Метод
	               |ИЗ
	               |	РегистрСведений.МетодСписанияТМЦ.СрезПоследних(&Дата, ) КАК МетодСписанияТМЦСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РезультатФункции = Выборка.Метод;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции