Функция МетодСписанияНаДатуДокумента(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	УчетнаяПолитикаСрезПоследних.МетодСписания КАК МетодСписания
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата, ) КАК УчетнаяПолитикаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УчетнаяПолитикаСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	МетодСписания = РезультатЗапроса.МетодСписания;
	
	Возврат МетодСписания
КонецФункции